multiMapTable = {
    "41000110A":[
        "Read1",
        "Listen1"
    ],
    "41000110B":[
        "Read2",
        "Listen2"
    ]
}

singleMapTable = {
    # 第一学期，倒数第二位2->读写，3->听说，最后一位是层次
    "00020021A":"Read1",
    "00020022A":"Read1",
    "00020023A":"Read1",
    "00020031A":"Listen1",
    "00020032A":"Listen1",
    "00020033A":"Listen1",
    # 第二学期三层次常规课
    "00020023B":"Read2",
    "00020033B":"Listen2",
    # 听说二层
    "00020032B1":"Listen2",  # 高级英语口语
    "00020032B2":"Listen2",  # 视听说与跨文化交际
    "00020032B4":"Listen2",  # 英文电影视听说与文化赏析
    "00020032B3":"Listen2",  # 国际学术交流英语
    # 读写二层
    "00020022B1":"Read2",  # 新闻英语读写
    "00020022B2":"Read2",  # 翻译基础与实践
    "00020022B5":"Read2",  # 学术性阅读：语言与思维
    "00020022B6":"Read2",  # 学术英语写作
}
